; domain
(define (domain satellite-typed)
(:requirements :equality :strips :typing)
(:types satellite
        direction
        instrument
        mode)
(:predicates
 (on_board ?i - instrument ?s - satellite)
 (supports ?i - instrument ?m - mode)
 (pointing ?s - satellite ?d - direction)
 (power_avail ?s - satellite)
 (power_on ?i - instrument)
 (calibrated ?i - instrument)
 (have_image ?d - direction ?m - mode)
 (calibration_target ?i - instrument ?d - direction))

(:action turn_to
 :parameters ( ?s - satellite ?d_new ?d_prev - direction)
 :precondition
 (and
      (pointing ?s ?d_prev)
      )
 :effect
 (and (pointing ?s ?d_new)
      (not (pointing ?s ?d_prev))))

(:action switch_on
 :parameters (?i - instrument ?s - satellite)
 :precondition
 (and (on_board ?i ?s)
      (power_avail ?s))
 :effect
 (and (power_on ?i)
      (not (calibrated ?i))
      (not (power_avail ?s))))

(:action switch_off
 :parameters (?i - instrument ?s - satellite)
 :precondition
	(and (on_board ?i ?s)
             (power_on ?i))
 :effect
	(and (power_avail ?s)
             (not (power_on ?i))))

(:action calibrate
 :parameters (?i - instrument ?s - satellite ?d - direction)
 :precondition
	(and (on_board ?i ?s)
             (calibration_target ?i ?d)
             (pointing ?s ?d)
             (power_on ?i))
 :effect
	 (calibrated ?i))

(:action take_image
 :parameters (?i - instrument ?s - satellite ?d - direction ?m - mode)
 :precondition
	(and (calibrated ?i)
             (on_board ?i ?s)
             (supports ?i ?m)
             (power_on ?i)
             (pointing ?s ?d))
 :effect
	 (have_image ?d ?m))

)

; problem
(DEFINE (PROBLEM SATELLITE-TYPED-1) (:DOMAIN SATELLITE-TYPED)
 (:OBJECTS PHENOMENON6 - DIRECTION STAR5 - DIRECTION PHENOMENON4 - DIRECTION
  PHENOMENON3 - DIRECTION GROUNDSTATION2 - DIRECTION GROUNDSTATION1 - DIRECTION
  STAR0 - DIRECTION THERMOGRAPH0 - MODE SPECTROGRAPH2 - MODE IMAGE1 - MODE
  INSTRUMENT0 - INSTRUMENT SATELLITE0 - SATELLITE)
 (:INIT (POINTING SATELLITE0 PHENOMENON6) (POWER_AVAIL SATELLITE0)
  (ON_BOARD INSTRUMENT0 SATELLITE0)
  (CALIBRATION_TARGET INSTRUMENT0 GROUNDSTATION2)
  (SUPPORTS INSTRUMENT0 THERMOGRAPH0))
 (:GOAL
  (AND (HAVE_IMAGE PHENOMENON4 THERMOGRAPH0) (HAVE_IMAGE STAR5 THERMOGRAPH0)
       (HAVE_IMAGE PHENOMENON6 THERMOGRAPH0))))

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
2. (turn_to satellite0 groundstation2 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 3
3. (calibrate instrument0 satellite0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 3
4. (turn_to satellite0 star5 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star5)
   goals met: 0 of 3
5. (take_image instrument0 satellite0 star5 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 1 of 3
6. (turn_to satellite0 phenomenon6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 3
7. (take_image instrument0 satellite0 phenomenon6 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 2 of 3
8. (turn_to satellite0 phenomenon4 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon4)
   goals met: 2 of 3
9. (take_image instrument0 satellite0 phenomenon4 thermograph0)
   added: (have_image phenomenon4 thermograph0)
   goals met: 3 of 3
